#R version 3.6.1 (2019-07-05) -- "Action of the Toes"
#data.table 1.12.2
#lightgbm 2.2.4

#输入：
#	Antai_AE_round2_item_attr_20190813.csv
#	Antai_AE_round2_test_20190813.csv
#	Antai_AE_round2_train_20190813.csv
#输出：
#	result.csv
#执行：
#	RScript 預測.R %输出目录% %输入目录%`


Sys.setlocale("LC_CTYPE", "chinese_taiwan")

輸出目錄 = commandArgs()[length(commandArgs()) - 1]
輸入目錄 = commandArgs()[length(commandArgs())]

library(data.table)
library(lightgbm)
library(cvAUC)


商品表 = fread(paste0(輸入目錄, "/Antai_AE_round2_item_attr_20190813.csv"), col.names = c("商品標識", "類目標識", "店鋪標識", "價格"))

測試表 = fread(paste0(輸入目錄, "/Antai_AE_round2_test_20190813.csv"), col.names = c("國家標識", "買家標識", "商品標識", "訂單時間", "買家單序", "購買標誌"))
測試表$記錄標識 = 1:nrow(測試表)
測試表$訂單秒序 = as.double(as.POSIXct(測試表$訂單時間)) - 1525104000
測試表$訂單日序 = 測試表$訂單秒序 %/% 86400
測試表 = merge(測試表, 商品表, by = "商品標識", all.x = T)
測試表[is.na(測試表)] = -1

訓練表 = fread(paste0(輸入目錄, "/Antai_AE_round2_train_20190813.csv"), col.names = c("國家標識", "買家標識", "商品標識", "訂單時間", "買家單序", "購買標誌"))
訓練表$記錄標識 = -1:-nrow(訓練表)
訓練表$訂單秒序 = as.double(as.POSIXct(訓練表$訂單時間)) - 1525104000
訓練表$訂單日序 = 訓練表$訂單秒序 %/% 86400
訓練表 = merge(訓練表, 商品表, by = "商品標識", all.x = T)
訓練表[is.na(訓練表)] = -1


計算差分 = function(甲, 方向)
{
	if (length(甲) == 1)
		return (as.double(NA))
	if (方向 == 0)
		return (as.double(甲 - c(NA, 甲[1:(length(甲) - 1)])))
	if (方向 == 1)
		return (as.double(c(甲[2:length(甲)], NA) - 甲))
}


取得前後 = function(甲, 方向)
{
	if (length(甲) == 1)
		return (as.double(NA))
	if (方向 == 0)
		return (as.double(c(NA, 甲[1:(length(甲) - 1)])))
	if (方向 == 1)
		return (as.double(c(甲[2:length(甲)], NA)))
}

訓練標籤表 = 訓練表[國家標識 != "xx"][買家單序 == 1]
訓練特征表 = 訓練表[國家標識 != "xx"][買家單序 != 1]
訓練特征表 = merge(訓練特征表, 訓練特征表[, .(買家之最大訂單秒序 = max(訂單秒序), 買家之最大訂單日序 = max(訂單日序)), .(買家標識)], by = "買家標識")
測試特征表 = merge(測試表, 測試表[, .(買家之最大訂單秒序 = max(訂單秒序), 買家之最大訂單日序 = max(訂單日序)), .(買家標識)], by = "買家標識")


測訓表 = rbind(訓練特征表, 測試特征表)
測訓表[is.na(測訓表)] = -1

商品統計表 = 測訓表[, .(
	商品之點擊數 = .N
	, 商品之點擊買家數 = length(unique(買家標識))
	, 商品之購買買家數 = length(unique(買家標識[購買標誌 == 1]))
	, 商品之購買買家比 = length(unique(買家標識[購買標誌 == 1])) / length(unique(買家標識))
), .(商品標識)]
買家商品統計表 = 測訓表[, .(買家商品之購買數 = length(unique(訂單日序[購買標誌 == 1]))), .(買家標識, 商品標識, 類目標識, 店鋪標識)]
商品統計表 = merge(商品統計表, 買家商品統計表[, .(
	商品之平均買家購買數 = mean(買家商品之購買數)
	, 商品之買家購買數大於1數 = length(買家標識[買家商品之購買數 > 1])
	, 商品之買家購買數大於1比例 = length(買家標識[買家商品之購買數 > 1]) / .N
), .(商品標識)], by = "商品標識", all.x = T)


提取甲資料表 = function(某表, 某特征表)
{
	某買家時特征甲表 = 某特征表[, .(商品標識, 類目標識, 訂單秒序, 買家單序), .(買家標識, 訂單時序 = 訂單秒序 %/% 1800)]
	某買家時特征甲表 = merge(某買家時特征甲表, 某買家時特征甲表[, .(買家時之點擊數 = .N, 買家時之商品數 = length(unique(商品標識)), 買家時之類目數 = length(unique(類目標識))), .(買家標識, 訂單時序)], by = c("買家標識", "訂單時序"))
	某買家時特征乙表 = 某特征表[, .(商品標識, 類目標識, 訂單秒序, 買家單序), .(買家標識, 訂單時序 = (訂單秒序 + 900) %/% 1800)]
	某買家時特征乙表 = merge(某買家時特征乙表, 某買家時特征乙表[, .(買家時之點擊數 = .N, 買家時之商品數 = length(unique(商品標識)), 買家時之類目數 = length(unique(類目標識))), .(買家標識, 訂單時序)], by = c("買家標識", "訂單時序"))
	某買家時特征表 = rbind(某買家時特征甲表, 某買家時特征乙表)
	某買家時特征表 = 某買家時特征表[, .(
		買家時之點擊數 = sum(買家時之點擊數) / 2
		, 買家時之商品數 = sum(買家時之商品數) / 2
		, 買家時之類目數 = sum(買家時之類目數) / 2
		, 買家時之店鋪數 = sum(買家時之類目數) / 2
	), .(買家標識, 商品標識, 類目標識, 訂單秒序, 買家單序)]
	某買家商品時表 = 某買家時特征表[order(買家單序), .(
		買家時之點擊數 = 買家時之點擊數[1]
		, 買家時之商品數 = 買家時之商品數[1]
		, 買家時之類目數 = 買家時之類目數[1]
		, 買家時之店鋪數 = 買家時之店鋪數[1]
		, 買家時之最小點擊數 = min(買家時之點擊數)
		, 買家時之最小商品數 = min(買家時之商品數)
		, 買家時之最小類目數 = min(買家時之商品數)
		, 買家時之最小店鋪數 = min(買家時之店鋪數)
		, 買家時之最大點擊數 = max(買家時之點擊數)
		, 買家時之最大商品數 = max(買家時之商品數)
		, 買家時之最大類目數 = max(買家時之類目數)
		, 買家時之最大店鋪數 = max(買家時之店鋪數)
	), .(買家標識, 商品標識)]


	某測訓表 = rbind(訓練特征表, 測試特征表)
	某測訓表[is.na(某測訓表)] = -1
	某測訓表 = 某測訓表[order(-買家單序)]
	某鄰商品表 = 某測訓表[, .(商品標識, 鄰商品標識 = 取得前後(商品標識, 0)), .(買家標識)]
	某鄰商品表 = rbind(某鄰商品表, 某測訓表[, .(商品標識, 鄰商品標識 = 取得前後(商品標識, 1)), .(買家標識)])
	某鄰商品表 = 某鄰商品表[!is.na(鄰商品標識) & 商品標識 != 鄰商品標識]
	某鄰商品表 = 某鄰商品表[, .(商品鄰商品之數 = .N), .(商品標識, 鄰商品標識)]

	某相關商品表 = merge(
		某測訓表[, .(商品標識 = unique(商品標識)), .(買家標識, 類目標識, 訂單日序)]
		, 某測訓表[, .(相關商品標識 = unique(商品標識)), .(買家標識, 類目標識, 訂單日序)]
	, by = c("買家標識", "類目標識", "訂單日序"), allow.cartesian = T)
	某相關商品表 = 某相關商品表[, .(商品相關商品之相關度 = .N), .(商品標識, 相關商品標識)]

	某買家相關商品表 = merge(某表, 商品表, by = "商品標識", all.x = T)
	某買家相關商品表 = merge(某買家相關商品表, 某特征表[買家單序 == 2, .(買家標識, 相關商品標識 = 商品標識)], by = "買家標識", allow.cartesian = T)
	某買家相關商品表 = merge(某買家相關商品表, 某鄰商品表[, .(商品標識, 相關商品標識 = 鄰商品標識, 商品鄰商品之數)], by = c("商品標識", "相關商品標識"), all.x = T, allow.cartesian = T)
	某買家相關商品表 = merge(某買家相關商品表, 某相關商品表, by = c("商品標識", "相關商品標識"), all.x = T, allow.cartesian = T)
	某買家相關商品表[is.na(某買家相關商品表)] = 0
	某買家相關商品表 = 某買家相關商品表[, .(買家標識, 商品標識, 商品鄰商品之數, 商品相關商品之相關度)]


	某買家表 = 某特征表[, .(
		買家之點擊數 = .N
		, 買家之購買數 = length(購買標誌[購買標誌 == 1])
		, 買家國家 = as.double(max(國家標識) == "yy")
	), .(買家標識, 買家之最大訂單秒序, 買家之最大訂單日序)]

	某買家商品表 = 某特征表[購買標誌 == 1, .(
		買家商品之點擊數 = .N
		, 買家商品之最後秒點擊數 = length(訂單秒序[訂單秒序 == 買家之最大訂單秒序])
		, 買家商品之近一小時點擊數 = length(訂單秒序[訂單秒序 - 買家之最大訂單秒序 > -3600])
		, 買家商品之近二小時點擊數 = length(訂單秒序[訂單秒序 - 買家之最大訂單秒序 > -7200])
		, 買家商品之近三小時點擊數 = length(訂單秒序[訂單秒序 - 買家之最大訂單秒序 > -10800])
		, 買家商品之當日點擊數 = length(訂單日序[訂單日序 == 買家之最大訂單日序])
		, 買家商品之購買日數 = length(unique(訂單日序))
		, 買家商品之最小購買日序 = min(訂單日序)
		, 買家商品之最大購買日序 = max(訂單日序)

		, 買家商品之最大秒序差 = min(max(訂單秒序) - 買家之最大訂單秒序)
		, 買家商品之最大日序差 = min(max(訂單日序) - 買家之最大訂單日序)
		
		, 買家商品之最小單序 = min(買家單序)
		, 買家商品之最大單序 = max(買家單序)
		, 買家商品之單序極差 = max(買家單序) - min(買家單序)
		, 買家商品之中位單序 = as.double(median(買家單序))
	), .(買家標識, 商品標識, 類目標識, 店鋪標識, 價格)]
	某買家商品表 = merge(某買家商品表, 某特征表[購買標誌 == 1, .(買家商品秒序之數 = .N, 買家商品秒序之最小單序 = min(買家單序)), .(買家標識, 商品標識, 訂單秒序, 訂單日序, 買家之最大訂單日序)][, .(
		買家商品之最大秒序之數 = max(買家商品秒序之數)
		, 買家商品之最小秒序數大於1單序 = min(c(買家商品秒序之最小單序[買家商品秒序之數 > 1], Inf))
		, 買家商品之最小秒序數大於1單序差 = min(c(買家商品秒序之最小單序[買家商品秒序之數 > 1], Inf)) - min(買家商品秒序之最小單序)
		, 買家商品之秒序數大於1數 = length(買家商品秒序之數[買家商品秒序之數 > 1])
		, 買家商品之秒序數大於1比例 = length(買家商品秒序之數[買家商品秒序之數 > 1]) / .N
		, 買家商品之秒序數大於2數 = length(買家商品秒序之數[買家商品秒序之數 > 2])
		, 買家商品之秒序數大於2比例 = length(買家商品秒序之數[買家商品秒序之數 > 2]) / .N
		, 買家商品之當日秒序數大於1數 = length(買家商品秒序之數[買家商品秒序之數 > 1 & 訂單日序 == 買家之最大訂單日序])
	), .(買家標識, 商品標識)], by = c("買家標識", "商品標識"), all.x = T)

	某買家商品表 = merge(某買家商品表, 某特征表[order(-買家單序)][, .(
		商品標識
		, 買家單序
		, 買家商品之秒序前差分 = 計算差分(訂單秒序, 0)
		, 買家商品之秒序後差分 = 計算差分(訂單秒序, 1)
		, 買家商品之前同類目 = as.double(取得前後(類目標識, 0) == 類目標識)
		, 買家商品之後同類目 = as.double(取得前後(類目標識, 1) == 類目標識)
	), .(買家標識)][, .(
		買家商品之秒序前差分 = 買家商品之秒序前差分[買家單序 == min(買家單序)]
		, 買家商品之秒序後差分 = 買家商品之秒序後差分[買家單序 == min(買家單序)]
		, 買家商品之前同類目 = 買家商品之前同類目[買家單序 == min(買家單序)]
		, 買家商品之後同類目 = 買家商品之後同類目[買家單序 == min(買家單序)]
		, 買家商品之總前同類目 = sum(買家商品之前同類目, na.rm = T)
		, 買家商品之總後同類目 = sum(買家商品之後同類目, na.rm = T)
	), .(買家標識, 商品標識)], by = c("買家標識", "商品標識"), all.x = T)

	某買家商品表 = merge(某買家商品表, 某特征表[order(-買家單序)][購買標誌 == 1, .(
		買家單序
		, 買家商品之商品單序前差分 = 計算差分(買家單序, 0)
		, 買家商品之商品秒序前差分 = 計算差分(訂單秒序, 0)
	), .(買家標識, 商品標識)][, .(
		買家商品之商品單序前差分 = 買家商品之商品單序前差分[買家單序 == min(買家單序)]
		, 買家商品之商品秒序前差分 = 買家商品之商品秒序前差分[買家單序 == min(買家單序)]
	), .(買家標識, 商品標識)], by = c("買家標識", "商品標識"), all.x = T)

	某買家商品表 = merge(某買家商品表, 某特征表[購買標誌 == 1, .(
		買家單序 = min(買家單序)
		, 訂單秒序 = max(訂單秒序)
	), .(買家標識, 商品標識, 類目標識)][order(-買家單序)][, .(
		商品標識
		, 買家商品之最後秒序前差分 = 計算差分(訂單秒序, 0)
		, 買家商品之最後秒序後差分 = 計算差分(訂單秒序, 1)
		, 買家商品之最後秒序前二差分 = 計算差分(取得前後(訂單秒序, 0), 0)
		, 買家商品之最後秒序後二差分 = 計算差分(取得前後(訂單秒序, 1), 1)
	), .(買家標識)], by = c("買家標識", "商品標識"), all.x = T)

	某買家商品表 = merge(某買家商品表, 某買家商品表[, .(
		商品標識
		, 買家商品之點擊數序 = rank(買家商品之點擊數)
		, 買家商品之最後秒點擊數序 = rank(買家商品之最後秒點擊數)
		, 買家商品之近一小時點擊數序 = rank(買家商品之近一小時點擊數)
		, 買家商品之近二小時點擊數序 = rank(買家商品之近二小時點擊數)
		, 買家商品之近三小時點擊數序 = rank(買家商品之近三小時點擊數)
		, 買家商品之當日點擊數序 = rank(買家商品之當日點擊數)
		, 買家商品之購買日數序 = rank(買家商品之購買日數)
		, 買家商品之最小購買日序序 = rank(買家商品之最小購買日序)
		, 買家商品之最大購買日序序 = rank(買家商品之最大購買日序)
		, 買家商品之最大秒序差序 = rank(買家商品之最大秒序差)
		, 買家商品之最大日序差序 = rank(買家商品之最大日序差)
		, 買家商品之最小單序序 = rank(買家商品之最小單序)
		, 買家商品之最大單序序 = rank(買家商品之最大單序)
		, 買家商品之單序極差序 = rank(買家商品之單序極差)
		, 買家商品之中位單序序 = rank(買家商品之中位單序)
		, 買家商品之價格序 = rank(價格)

		, 買家商品之最大秒序之數序 = rank(買家商品之最大秒序之數)
		, 買家商品之最小秒序數大於1單序序 = rank(買家商品之最小秒序數大於1單序)
		, 買家商品之最小秒序數大於1單序差序 = rank(買家商品之最小秒序數大於1單序)
		, 買家商品之秒序數大於1數序 = rank(買家商品之秒序數大於1數)
		, 買家商品之秒序數大於1比例序 = rank(買家商品之秒序數大於1比例)
		, 買家商品之秒序數大於2數序 = rank(買家商品之秒序數大於2數)
		, 買家商品之秒序數大於2比例序 = rank(買家商品之秒序數大於2比例)
		, 買家商品之當日秒序數大於1數序 = rank(買家商品之當日秒序數大於1數)

		
		, 買家商品之秒序前差分序 = rank(買家商品之秒序前差分)
		, 買家商品之秒序後差分序 = rank(買家商品之秒序後差分)
		, 買家商品之前同類目序 = rank(買家商品之前同類目)
		, 買家商品之後同類目序 = rank(買家商品之後同類目)
		, 買家商品之商品單序前差分序 = rank(買家商品之商品單序前差分)
		, 買家商品之商品秒序前差分序 = rank(買家商品之商品秒序前差分)

		, 買家商品之最後秒序前差分序 = rank(買家商品之最後秒序前差分)
		, 買家商品之最後秒序後差分序 = rank(買家商品之最後秒序後差分)
	), .(買家標識)], by = c("買家標識", "商品標識"), all.x = T)

	某買家商品表 = merge(某買家商品表, 某買家商品表[, .(
		商品標識
		, 買家商品之類目點擊數序 = rank(買家商品之點擊數)
		, 買家商品之類目最後秒點擊數序 = rank(買家商品之最後秒點擊數)
		, 買家商品之類目近一小時點擊數序 = rank(買家商品之近一小時點擊數)
		, 買家商品之類目近二小時點擊數序 = rank(買家商品之近二小時點擊數)
		, 買家商品之類目近三小時點擊數序 = rank(買家商品之近三小時點擊數)
		, 買家商品之類目當日點擊數序 = rank(買家商品之當日點擊數)
		, 買家商品之類目購買日數序 = rank(買家商品之購買日數)
		, 買家商品之類目最小購買日序序 = rank(買家商品之最小購買日序)
		, 買家商品之類目最大購買日序序 = rank(買家商品之最大購買日序)
		, 買家商品之類目最小單序序 = rank(買家商品之最小單序)
		, 買家商品之類目最大單序序 = rank(買家商品之最大單序)
		, 買家商品之類目中位單序序 = rank(買家商品之中位單序)
	), .(買家標識, 類目標識)], by = c("買家標識", "類目標識", "商品標識"), all.x = T)
	某買家商品表 = merge(某買家商品表, 某買家商品表[, .(
		商品標識
		, 買家商品之店鋪點擊數序 = rank(買家商品之點擊數)
		, 買家商品之店鋪最後秒點擊數序 = rank(買家商品之最後秒點擊數)
		, 買家商品之店鋪近一小時點擊數序 = rank(買家商品之近一小時點擊數)
		, 買家商品之店鋪近二小時點擊數序 = rank(買家商品之近二小時點擊數)
		, 買家商品之店鋪近三小時點擊數序 = rank(買家商品之近三小時點擊數)
		, 買家商品之店鋪當日點擊數序 = rank(買家商品之當日點擊數)
		, 買家商品之店鋪購買日數序 = rank(買家商品之購買日數)
		, 買家商品之店鋪最小購買日序序 = rank(買家商品之最小購買日序)
		, 買家商品之店鋪最大購買日序序 = rank(買家商品之最大購買日序)
		, 買家商品之店鋪最小單序序 = rank(買家商品之最小單序)
		, 買家商品之店鋪最大單序序 = rank(買家商品之最大單序)
		, 買家商品之店鋪中位單序序 = rank(買家商品之中位單序)
	), .(買家標識, 店鋪標識)], by = c("買家標識", "店鋪標識", "商品標識"), all.x = T)
	某買家商品表 = 某買家商品表[, -c(
		"類目標識", "店鋪標識"
		, "買家商品之點擊數", "買家商品之最後秒點擊數", "買家商品之近一小時點擊數", "買家商品之近二小時點擊數", "買家商品之近三小時點擊數", "價格"
	)]

	某買家類目表 = 某特征表[, .(
		買家類目之點擊數 = .N
		, 買家類目之最小單序 = min(買家單序)
	), .(買家標識, 類目標識)]
	某買家類目表 = merge(某買家類目表, 某買家類目表[, .(
		類目標識
		, 買家類目之點擊數序 = rank(買家類目之點擊數)
		, 買家類目之最小單序序 = rank(買家類目之最小單序)
	), .(買家標識)], by = c("買家標識", "類目標識"), all.x = T)


	某買家店鋪表 = 某特征表[, .(
		買家店鋪之點擊數 = .N
		, 買家店鋪之最小單序 = min(買家單序)
	), .(買家標識, 店鋪標識)]
	某買家店鋪表 = merge(某買家店鋪表, 某買家店鋪表[, .(
		店鋪標識
		, 買家店鋪之點擊數序 = rank(買家店鋪之點擊數)
		, 買家店鋪之最小單序序 = rank(買家店鋪之最小單序)
	), .(買家標識)], by = c("買家標識", "店鋪標識"), all.x = T)

	某資料表 = merge(某表, 商品表, by = "商品標識", all.x = T)
	某資料表 = merge(某資料表, 某買家表, by = c("買家標識"), all.x = T)
	某資料表 = merge(某資料表, 某買家商品表, by = c("買家標識", "商品標識"), all.x = T)
	某資料表 = merge(某資料表, 某買家商品時表, by = c("買家標識", "商品標識"), all.x = T)
	某資料表 = merge(某資料表, 某買家相關商品表, by = c("買家標識", "商品標識"), all.x = T)
	某資料表 = merge(某資料表, 某買家類目表, by = c("買家標識", "類目標識"), all.x = T)
	某資料表 = merge(某資料表, 某買家店鋪表, by = c("買家標識", "店鋪標識"), all.x = T)
	某資料表 = merge(某資料表, 某特征表[購買標誌 == 1, .(商品標識, 買家之類目單序序 = rank(買家單序)), .(買家標識, 類目標識)][, .(買家商品之最小類目單序序 = min(買家之類目單序序)), .(買家標識, 商品標識)], by = c("買家標識", "商品標識"), all.x = T)
	某資料表 = merge(某資料表, 某特征表[購買標誌 == 1, .(商品標識, 買家之店鋪單序序 = rank(買家單序)), .(買家標識, 店鋪標識)][, .(買家商品之最小店鋪單序序 = min(買家之店鋪單序序)), .(買家標識, 商品標識)], by = c("買家標識", "商品標識"), all.x = T)

	某資料表[is.na(某資料表)] = -1
	某資料表 = 某資料表[, -c("類目標識", "店鋪標識")]

	某資料表
}

甲測試資料表 = merge(unique(測試特征表[, .(買家標識, 商品標識)], by = NULL), unique(測試特征表[購買標誌 == 0, .(買家標識, 商品標識, 甲 = 1)], by = NULL), by = c("買家標識", "商品標識"), all.x = T)
甲測試資料表 = 甲測試資料表[is.na(甲), .(買家標識, 商品標識)]
甲測試資料表 = 提取甲資料表(甲測試資料表, 測試特征表)
甲測試資料表$標籤 = -1
甲測試資料表 = cbind(甲測試資料表[, .(買家標識, 商品標識, 標籤)], 甲測試資料表[, -c("買家標識", "商品標識", "標籤")])

甲訓練資料表 = merge(unique(訓練特征表[, .(買家標識, 商品標識)], by = NULL), unique(訓練特征表[購買標誌 == 0, .(買家標識, 商品標識, 甲 = 1)], by = NULL), by = c("買家標識", "商品標識"), all.x = T)
甲訓練資料表 = 甲訓練資料表[is.na(甲), .(買家標識, 商品標識)]
甲訓練資料表 = 提取甲資料表(甲訓練資料表, 訓練特征表)
甲訓練資料表 = merge(甲訓練資料表, 訓練標籤表[, .(買家標識, 商品標識, 標籤 = 1)], by = c("買家標識", "商品標識"), all.x = T)
甲訓練資料表[is.na(甲訓練資料表)] = 0
甲訓練資料表 = cbind(甲訓練資料表[, .(買家標識, 商品標識, 標籤)], 甲訓練資料表[, -c("買家標識", "商品標識", "標籤")])

rm(甲模型)
甲模型 = lgb.train(data = lgb.Dataset(data.matrix(甲訓練資料表[, c(-1:-3)]), label = 甲訓練資料表$標籤), objective = "binary", nround = 1000, learning_rate = 0.03, max_depth = 6, num_leaves = 127, bagging_fraction = 0.7, bagging_freq = 1, bagging_seed = 0, verbosity = -1)
甲預測表 = 甲測試資料表[, .(買家標識, 預測商品標識 = 商品標識, 打分 = predict(甲模型, data.matrix(甲測試資料表[, c(-1:-3)])))]
甲預測表 = 甲預測表[預測商品標識 %in% 訓練表$商品標識]


全測訓表 = rbind(測試表, 訓練表[買家單序 != 1])
全測訓表[is.na(全測訓表)] = -1
全測訓表 = merge(全測訓表, 全測訓表[, .(買家之最大訂單日序 = max(訂單日序), 買家之最大訂單秒序 = max(訂單秒序)), .(買家標識)], by = "買家標識")

測訓乙買家表 = rbind(甲測試資料表[, .(買家標識, 商品標識)], 甲訓練資料表[, .(買家標識, 商品標識)])
測訓乙買家表 = 測訓乙買家表[, .(買家預測數 = .N), .(買家標識)]
測訓乙買家表 = merge(data.table(買家標識 = unique(c(測試表$買家標識, 訓練表$買家標識))), 測訓乙買家表, by = "買家標識", all.x = T)
測訓乙買家表[is.na(測訓乙買家表)] = 0
測訓乙買家表 = 測訓乙買家表[買家預測數 < 30, .(買家標識)]

買家類目商品表 = 全測訓表[, .(點擊打分 = as.double(.N)), .(買家標識, 商品標識, 類目標識, 訂單日序, 購買標誌)]
買家類目商品表 = merge(
	買家類目商品表[, .(買家標識, 商品標識, 類目標識, 點擊打分)]
	, 買家類目商品表[商品標識 %in% 訓練表$商品標識, .(買家標識, 相關商品標識 = 商品標識, 類目標識, 相關點擊打分 = 點擊打分)]
, by = c("買家標識", "類目標識", "訂單日序"), allow.cartesian = T)
買家類目商品表 = 買家類目商品表[商品標識 != 相關商品標識]
相關商品原表 = 買家類目商品表[, .(商品相關度 = sum((點擊打分 * 相關點擊打分) ** 4) ** 0.25), .(商品標識, 相關商品標識)]
相關商品表 = 相關商品原表[商品相關度 > 1]

rm(買家類目商品表)

買家第一商品表 = merge(全測訓表[國家標識 != "xx" & 買家單序 < 25, .(商品標識, 買家標識, 買家單序, 秒序差 = 買家之最大訂單秒序 - 訂單秒序)], 相關商品表, by = "商品標識", allow.cartesian = T)
買家第一商品表 = 買家第一商品表[, .(候選度 = sum((商品相關度 / (秒序差 / 86400 * 買家單序)) ** 4) ** 0.25), .(買家標識, 商品標識 = 相關商品標識)]
買家第一商品表 = merge(買家第一商品表, unique(測訓表[, .(買家標識, 國家標識)], by = NULL), by = "買家標識")
買家第一商品表 = merge(買家第一商品表, unique(測訓表[, .(國家標識, 商品標識)], by = NULL), by = c("國家標識", "商品標識"))
買家第一商品表 = unique(買家第一商品表[, .(商品標識, 買家標識, 候選度)], by = NULL)

測訓候選表 = unique(買家第一商品表[, .(商品標識, 買家標識, 候選度)], by = NULL)


提取乙資料表 = function(某表, 某特征表)
{
	某資料表 = 某表
	某資料表 = merge(某資料表, 商品統計表, by = "商品標識", all.x = T)

	某資料表 = merge(某資料表, 某特征表[, .(
		買家類目之點擊數 = .N
		, 買家類目之最後日點擊數 = length(訂單日序[訂單日序 == 買家之最大訂單日序])
		, 買家類目之商品數 = length(unique(商品標識))
		, 買家類目之購買商品數 = length(unique(商品標識[購買標誌 == 1]))
		, 買家類目之最後日購買商品數 = length(unique(商品標識[購買標誌 == 1 & 訂單日序 == 買家之最大訂單日序]))
		, 買家類目之最小價格 = min(價格)
		, 買家類目之最大價格 = max(價格)
		, 買家類目之平均價格 = mean(價格)
		, 買家類目之最小單序 = min(買家單序)
		, 買家類目之最後價格 = min(價格[買家單序 == max(買家單序)])
	), .(買家標識, 類目標識)], by = c("買家標識", "類目標識"), all.x = T)

	某資料表 = merge(某資料表, 某特征表[, .(
		買家店鋪之點擊數 = .N
		, 買家店鋪之最後日點擊數 = length(訂單日序[訂單日序 == 買家之最大訂單日序])
		, 買家店鋪之商品數 = length(unique(商品標識))
		, 買家店鋪之購買商品數 = length(unique(商品標識[購買標誌 == 1]))
		, 買家店鋪之最後日購買商品數 = length(unique(商品標識[購買標誌 == 1 & 訂單日序 == 買家之最大訂單日序]))
		, 買家店鋪之最小單序 = min(買家單序)
	), .(買家標識, 店鋪標識)], by = c("買家標識", "店鋪標識"), all.x = T)

	某資料表$買家類目之最小價格差 = 某資料表$買家類目之最小價格 - 某資料表$價格
	某資料表$買家類目之最大價格差 = 某資料表$買家類目之最大價格 - 某資料表$價格
	某資料表$買家類目之平均價格差 = 某資料表$買家類目之平均價格 - 某資料表$價格
	某資料表$買家類目之最後價格差 = 某資料表$買家類目之最後價格 - 某資料表$價格

	某資料表 = 某資料表[, -c("類目標識", "店鋪標識")]

	某資料表
}

乙測試資料表 = merge(測試特征表[, .(買家標識, 商品標識, 甲 = 0)], 測訓候選表[買家標識 %in% 測試特征表$買家標識, .(買家標識, 商品標識, 候選度)], by = c("買家標識", "商品標識"), all.y = T)
乙測試資料表 = 乙測試資料表[is.na(甲), .(買家標識, 商品標識, 候選度)]
乙測試資料表 = merge(乙測試資料表, 商品表[, .(商品標識, 類目標識, 店鋪標識)], by = c("商品標識"), all.x = T)
乙測試資料表[is.na(乙測試資料表)] = -1
乙測試資料表 = 提取乙資料表(乙測試資料表, 測試特征表)
乙測試資料表$標籤 = -1
乙測試資料表 = cbind(乙測試資料表[, .(買家標識, 商品標識, 標籤)], 乙測試資料表[, -c("買家標識", "商品標識", "標籤")])

乙訓練資料表 = merge(訓練特征表[, .(買家標識, 商品標識, 甲 = 0)], 測訓候選表[買家標識 %in% 訓練特征表$買家標識, .(買家標識, 商品標識, 候選度)], by = c("買家標識", "商品標識"), all.y = T)
乙訓練資料表 = 乙訓練資料表[is.na(甲), .(買家標識, 商品標識, 候選度)]
乙訓練資料表 = merge(乙訓練資料表, 商品表[, .(商品標識, 類目標識, 店鋪標識)], by = c("商品標識"), all.x = T)
乙訓練資料表[is.na(乙訓練資料表)] = -1
乙訓練資料表 = 提取乙資料表(乙訓練資料表, 訓練特征表)
乙訓練資料表 = merge(乙訓練資料表, 訓練標籤表[, .(買家標識, 商品標識, 標籤 = 1)], by = c("買家標識", "商品標識"), all.x = T)
乙訓練資料表[is.na(乙訓練資料表)] = 0
乙訓練資料表 = cbind(乙訓練資料表[, .(買家標識, 商品標識, 標籤)], 乙訓練資料表[, -c("買家標識", "商品標識", "標籤")])


rm(乙模型)
乙模型 = lgb.train(data = lgb.Dataset(data.matrix(乙訓練資料表[, c(-1:-3)]), label = 乙訓練資料表$標籤), objective = "binary", nround = 1000, learning_rate = 0.03, max_depth = 6, num_leaves = 127, bagging_fraction = 0.7, bagging_freq = 1, bagging_seed = 0, verbose = -1, verbosity = -1)
乙預測表 = 乙測試資料表[, .(買家標識, 預測商品標識 = 商品標識, 打分 = predict(乙模型, data.matrix(乙測試資料表[, c(-1:-3)])))]

合併預測表 = rbind(甲預測表[, .(買家標識, 預測商品標識, 打分 = 1 + 打分)], 乙預測表)
合併預測表 = 合併預測表[預測商品標識 %in% 訓練表$商品標識]

商品統計表 = 商品統計表[order(-商品之點擊數)]
補充預測表 = 合併預測表[, .(預測數 = .N), .(買家標識)][預測數 < 30, .(買家標識, 甲 = 1)]
補充預測表 = 補充預測表[, .(買家標識 = c(買家標識, 測試表[!買家標識 %in% 合併預測表$買家標識]$買家標識), 甲 = 1)]
補充預測表 = merge(補充預測表, 商品統計表[1:30, .(商品標識, 甲 = 1)], by = "甲", allow.cartesian = T)
if (nrow(補充預測表) > 0)
{
	補充預測表 = 補充預測表[, .(買家標識, 預測商品標識 = 商品標識, 打分 = 0)]
	預測表 = rbind(合併預測表, 補充預測表)
}

預測表 = 預測表[, .(預測商品標識, 排名 = 1 + .N - rank(打分, ties.method="first")), .(買家標識)]
預測表 = 預測表[排名 <= 30]


setorder(預測表, 排名)
提交表 = 預測表[, .(預測字串 = paste(預測商品標識, collapse ="," )), .(買家標識)]
write.table(提交表, paste0(輸出目錄, "/result.csv"), sep = ",", quote = F, row.names = F, col.names = F)
