library(data.table)
library(lightgbm)

測試日序 = -7

取得資料 = function(某會員表, 某氣入追加表, 某入札表, 某落札表, 某日序)
{
	候選表 = unique(rbind(某氣入追加表[, .(會員標識, 商品標識)], 某入札表[, .(會員標識, 商品標識)]), by = NULL)
	候選表 = merge(候選表, 拍賣表[, .(拍賣標識, 商品標識)], by = "商品標識")
	候選表 = unique(候選表[, .(會員標識, 拍賣標識)], by=NULL)

	候選表 = merge(候選表, 某會員表, by = "會員標識")
	候選表 = merge(候選表, 拍賣表[, .(拍賣標識, 商品種別標識, 商品標識, 再出品回數, 狀態標識, 品牌標識, 類型標識, 類型組標識, 線標識, 男女別標識, 拍賣作成日序 = 某日序 - 拍賣作成日序)], by = "拍賣標識")

	某氣入追加表[, 某氣入追加日序 := 某日序 - 氣入追加日序]
	候選表 = merge(候選表, 某氣入追加表[, .(
		氣入追加數 = .N
		, 氣入追加之最小日序 = min(某氣入追加日序)
		, 氣入追加之最大日序 = max(某氣入追加日序)
		, 氣入追加之日序極差 = max(某氣入追加日序) - min(某氣入追加日序)
		, 氣入追加之削除標記 = max(削除標記[氣入追加日序 == max(氣入追加日序)])
	), .(會員標識, 拍賣標識)], by = c("會員標識", "拍賣標識"), all.x = T)
	候選表 = merge(候選表, 某氣入追加表[, .(拍賣氣入追加數 = .N), .(拍賣標識)], by = c("拍賣標識"), all.x = T)
	候選表 = merge(候選表, 某氣入追加表[, .(商品氣入追加數 = .N), .(商品標識)], by = c("商品標識"), all.x = T)
	候選表 = merge(候選表, 某氣入追加表[, .(品牌氣入追加數 = .N), .(品牌標識)], by = c("品牌標識"), all.x = T)
	候選表 = merge(候選表, 某氣入追加表[, .(線氣入追加數 = .N), .(線標識)], by = c("線標識"), all.x = T)
	候選表 = merge(候選表, 某氣入追加表[, .(會員商品氣入追加數 = .N), .(會員標識, 商品標識)], by = c("會員標識", "商品標識"), all.x = T)
	候選表 = merge(候選表, 某氣入追加表[, .(會員品牌氣入追加數 = .N), .(會員標識, 品牌標識)], by = c("會員標識", "品牌標識"), all.x = T)
	候選表 = merge(候選表, 某氣入追加表[, .(會員類型組氣入追加數 = .N), .(會員標識, 類型組標識)], by = c("會員標識", "類型組標識"), all.x = T)
	候選表 = merge(候選表, 某氣入追加表[, .(會員線氣入追加數 = .N), .(會員標識, 線標識)], by = c("會員標識", "線標識"), all.x = T)

	某入札表[, 某入札日序 := 某日序 - 入札日序]
	候選表 = merge(候選表, 某入札表[, .(
		入札數 = .N
		, 入札之最小日序 = min(某入札日序)
		, 入札之最大日序 = max(某入札日序)
		, 入札之日序極差 = max(某入札日序) - min(某入札日序)
	), .(會員標識, 拍賣標識)], by = c("會員標識", "拍賣標識"), all.x = T)
	候選表 = merge(候選表, 某入札表[, .(拍賣入札數 = .N), .(拍賣標識)], by = c("拍賣標識"), all.x = T)
	候選表 = merge(候選表, 某入札表[, .(商品入札數 = .N), .(商品標識)], by = c("商品標識"), all.x = T)
	候選表 = merge(候選表, 某入札表[, .(品牌入札數 = .N), .(品牌標識)], by = c("品牌標識"), all.x = T)
	候選表 = merge(候選表, 某入札表[, .(線入札數 = .N), .(線標識)], by = c("線標識"), all.x = T)
	候選表 = merge(候選表, 某入札表[, .(會員商品入札數 = .N), .(會員標識, 商品標識)], by = c("會員標識", "商品標識"), all.x = T)
	候選表 = merge(候選表, 某入札表[, .(會員品牌入札數 = .N), .(會員標識, 品牌標識)], by = c("會員標識", "品牌標識"), all.x = T)
	候選表 = merge(候選表, 某入札表[, .(會員類型組入札數 = .N), .(會員標識, 類型組標識)], by = c("會員標識", "類型組標識"), all.x = T)
	候選表 = merge(候選表, 某入札表[, .(會員線入札數 = .N), .(會員標識, 線標識)], by = c("會員標識", "線標識"), all.x = T)

	候選表 = 候選表[, -c("商品種別標識", "商品標識", "品牌標識", "類型標識", "類型組標識", "線標識")]
	候選表[is.na(候選表)] = -1

	候選表
}

訓練資料表 = NULL
for (子 in 1:4)
{
	print(子)
	訓練參照表 = rbind(
		氣入追加表[氣入追加日序 >= 測試日序 - 7 * 子 & 氣入追加日序 < 測試日序 - 7 * 子 + 7, .(會員標識, 拍賣標識, 標籤 = 1)]
		, 入札表[入札日序 >= 測試日序 - 7 * 子 & 入札日序 < 測試日序 - 7 * 子 + 7, .(會員標識, 拍賣標識, 標籤 = 2)]
	)
	訓練參照表 = 訓練參照表[, .(標籤 = max(標籤)), .(會員標識, 拍賣標識)]
	訓練會員表 = unique(訓練參照表[, .(會員標識)], by = NULL)

	訓練氣入追加表 = 氣入追加表[氣入追加日序 < 測試日序 - 7 * 子]
	訓練入札表 = 入札表[入札日序 < 測試日序 - 7 * 子]
	訓練落札表 = 落札表[落札日序 < 測試日序 - 7 * 子]


	訓練資料表子 = 取得資料(訓練會員表, 訓練氣入追加表, 訓練入札表, 訓練落札表, 測試日序 - 7 * 子)
	訓練資料表子 = merge(訓練資料表子, 氣入追加表[氣入追加日序 >= 測試日序 - 7 * 子 & 氣入追加日序 < 測試日序 - 7 * 子 + 7, .(氣入追加標籤 = 1), .(會員標識, 拍賣標識)], by = c("會員標識", "拍賣標識"), all.x = T)
	訓練資料表子 = merge(訓練資料表子, 入札表[入札日序 >= 測試日序 - 7 * 子 & 入札日序 < 測試日序 - 7 * 子 + 7, .(入札標籤 = 1), .(會員標識, 拍賣標識)], by = c("會員標識", "拍賣標識"), all.x = T)
	訓練資料表子[is.na(訓練資料表子)] = 0
	訓練資料表子 = cbind(訓練資料表子[, .(會員標識, 拍賣標識, 氣入追加標籤, 入札標籤)], 訓練資料表子[, -c("會員標識", "拍賣標識", "氣入追加標籤", "入札標籤")])
	訓練資料表 = rbind(訓練資料表, 訓練資料表子)
}

氣入追加模型 = lgb.train(data = lgb.Dataset(data.matrix(訓練資料表[, c(-1:-4)]), label = 訓練資料表$氣入追加標籤), objective = "binary", nround = 500, learning_rate = 0.01, max_depth = 6, num_leaves = 127, verbosity = -1)
入札模型 = lgb.train(data = lgb.Dataset(data.matrix(訓練資料表[, c(-1:-4)]), label = 訓練資料表$入札標籤), objective = "binary", nround = 500, learning_rate = 0.01, max_depth = 6, num_leaves = 127, verbosity = -1)







測試資料表 = 取得資料(測試會員表, 氣入追加表, 入札表, 落札表, 測試日序)
測試資料表 = cbind(測試資料表[, .(會員標識, 拍賣標識, 氣入追加標籤 = -1, 入札標籤 = -1)], 測試資料表[, -c("會員標識", "拍賣標識")])
預測表 = 測試資料表[, .(會員標識, 拍賣標識, 氣入追加打分 = predict(氣入追加模型, data.matrix(測試資料表[, c(-1:-4)])), 入札打分 = predict(入札模型, data.matrix(測試資料表[, c(-1:-4)])))]
預測表 = 預測表[, .(會員標識, 拍賣標識, 打分 = 0.2 * 氣入追加打分 + 0.8 * 入札打分)]
預測表 = 預測表[, .(打分 = max(打分)), .(會員標識, 拍賣標識)]
預測表 = 預測表[order(-打分)]
預測表 = merge(預測表, 測試會員表, by = "會員標識", all.y = T)

set.seed(0)
補充表 = 拍賣表[拍賣作成日序 == 測試日序 - 5, .(拍賣標識 = sample(拍賣標識, 20))]
預測表 = 預測表[, .(預測序 = 1:20, 拍賣標識 = c(unique(拍賣標識[!is.na(拍賣標識)]), 補充表$拍賣標識)[1:20]), .(會員標識)]

write.csv(預測表[, .(KaiinID = 會員標識, AuctionID = 拍賣標識)], "20200106.csv", row.names = F, quote = F)
